stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_pwr_ex.c
  /* Configure the LDO as system regulator supply  */
  if (SupplySource == PWR_LDO_SUPPLY)
  {
    /* Set the power supply configuration */
    CLEAR_BIT(PWR->CR3, PWR_CR3_REGSEL);

    /* Wait until system switch on new regulator */
    while (HAL_IS_BIT_SET(PWR->SVMSR, PWR_SVMSR_REGS) && (timeout != 0U))
    {
      timeout--;
    }
  }
  /* Configure the SMPS as system regulator supply  */
  else
  {
    /* Set the power supply configuration */
    SET_BIT(PWR->CR3, PWR_CR3_REGSEL);

    /* Wait until system switch on new regulator */
    while (HAL_IS_BIT_CLR(PWR->SVMSR, PWR_SVMSR_REGS) && (timeout != 0U))
    {
      timeout--;
    }
  }

  /* Check time out  */
  if (timeout == 0U)
  {
    return HAL_TIMEOUT;
  }

  return HAL_OK;
}

/**
  * @brief  Get the power supply configuration.
  * @retval The supply configured.
  */
uint32_t  HAL_PWREx_GetSupplyConfig(void)
{
  return (PWR->SVMSR & PWR_SVMSR_REGS);
}
#endif /* defined(PWR_CR3_REGSEL) */

/**
  * @brief  Enable fast soft start for the current regulator.
  * @retval None.
  */
void HAL_PWREx_EnableFastSoftStart(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Disable fast soft start for the current regulator.
  * @retval None.
  */
void HAL_PWREx_DisableFastSoftStart(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Enable the Battery charging.
  * @note   When VDD is present, charge the external battery through an internal
  *         resistor.
  * @param  ResistorValue : Specifies the charging resistor.
  *                         This parameter can be one of the following values :
  *                         @arg PWR_BATTERY_CHARGING_RESISTOR_5   : 5 KOhm resistor.
  *                         @arg PWR_BATTERY_CHARGING_RESISTOR_1_5 : 1.5 KOhm resistor.
  * @retval None.
  */
void HAL_PWREx_EnableBatteryCharging(uint32_t ResistorValue)
{
  /* Check the parameter */
  assert_param(IS_PWR_BATTERY_RESISTOR_SELECT(ResistorValue));

  /* Specify the charging resistor and enable the Battery charging */
  MODIFY_REG(PWR->BDCR, (PWR_BDCR_VBRS | PWR_BDCR_VBE), (ResistorValue | PWR_BDCR_VBE));

}

/**
  * @brief  Disable the Battery charging.
  * @retval None.
  */
void HAL_PWREx_DisableBatteryCharging(void)
{
  /* Disable the Battery charging and restore default charging resistor value */
  CLEAR_BIT(PWR->BDCR, (PWR_BDCR_VBRS | PWR_BDCR_VBE));
}
/**
  * @}
  */


/** @defgroup PWREx_Exported_Functions_Group2 Low Power Control Functions
  * @brief    Low power control functions
  */

/**
  * @brief  Enter the whole system to Shutdown mode.
  * @note   Shutdown mode allows the lowest power consumption. The internal
  *         regulator is switched off so that the VCORE domain is powered off.
  *         The PLL, the HSI16, the MSI (MSIS and MSIK), the LSI and the HSE
  *         oscillators are also switched off.
  * @note   The SRAMs and register contents are lost except for registers in the
  *         Backup domain. The BOR is not available in Shutdown mode. No power
  *         voltage monitoring is possible in this mode, therefore the switch to
  *         Backup domain is not supported.
  * @retval None.
  */
void HAL_PWREx_EnterSHUTDOWNMode(void)
{
  /* Set Shutdown mode */
  MODIFY_REG(PWR->CR1, PWR_CR1_LPMS, (PWR_CR1_LPMS_1 | PWR_CR1_LPMS_2));

  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));

  /* Request Wait For Interrupt */
  __WFI();
}

/**
  * @brief  Enable BOR and PVD ultra-low power mode.
  * @note   BOR and PVD operations can be in discontinuous (ultra-low power) mode in
  *         Standby modes.
  * @note   This bit must be set to reach the lowest power consumption in the low-power modes.
  * @note   This bit shall not be set together with autonomous peripherals using HSI16
  *         as kernel clock.
  * @retval None.
  */
void HAL_PWREx_EnableUltraLowPowerMode(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}

/**
  * @brief  Disable BOR and PVD ultra-low power mode.
  * @retval None.
  */
void HAL_PWREx_DisableUltraLowPowerMode(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}
/**
  * @}
  */


/** @defgroup PWREx_Exported_Functions_Group3 Memories Retention Functions
  * @brief    Memories retention functions
  *
@verbatim
 ===============================================================================
                     ##### Memories Retention Functions #####
 ===============================================================================
    [..]
      Devices RAMs are configurable to reduce the consumption by powering off the SRAMi.
       (+) SRAM power down are :
             (++) SRAM1
             (++) SRAM2

    [..]
      Devices RAMs are configurable to retain or lose RAMs content
      during Stop mode (Stop 0/1/2/3).
       (+) Retained content RAMs in Stop modes are :
             (++) SRAM1
             (++) SRAM2
             (++) ICACHE
             (++) PKA SRAM
             (++) FDCAN and USB peripherals SRAM

    [..]
      Devices RAMs are configurable to retain or lose RAMs content
      in Standby mode.
       (+) Retained content RAMs in Standby mode are :
             (++) SRAM2

@endverbatim
  * @{
  */

/**
  * @brief  Enable RAMs power down.
  * @note   This bit is used to reduce the consumption by powering off the SRAMi.
  * @param RAMSelection: Specifies RAMs.
  *                      This parameter can be one of the following values :
  *                      @arg PWR_SRAM1_POWERDOWN  : SRAM1 powered off.
  *                      @arg PWR_SRAM2_POWERDOWN  : SRAM2 powered off.
  * @retval None.
  */
void HAL_PWREx_EnableRAMsPowerDown(uint32_t RAMSelection)
{
  /* Check the parameters */
  assert_param(IS_PWR_RAM_POWERDOWN(RAMSelection));

  /* SRAMi powered off */
  SET_BIT(PWR->CR1, RAMSelection);
}

/**
  * @brief  Disable RAMs power down.
  * @note   When this bit is cleared to 0, wait for more than 1.6us before accessing the SRAM.
  * @param RAMSelection: Specifies RAMs .
  *                      This parameter can be one of the following values :
  *                      @arg PWR_SRAM1_POWERDOWN  : SRAM1 powered on.
  *                      @arg PWR_SRAM2_POWERDOWN  : SRAM2 powered on.
  * @retval None.
  */
void HAL_PWREx_DisableRAMsPowerDown(uint32_t RAMSelection)
{
  /* Check the parameters */
  assert_param(IS_PWR_RAM_POWERDOWN(RAMSelection));

  /* SRAMi powered on */
  CLEAR_BIT(PWR->CR1, RAMSelection);
}

/**
  * @brief Enable RAMs content retention in Stop mode (Stop 0, 1, 2, 3).
  * @note  When enabling content retention for a given ram, memory is kept powered
  *        on in Stop mode. (Consumption is not optimized)
  * @param RAMSelection: Specifies RAMs content to be retained in Stop mode.
  *                      This parameter can be one or a combination of the following values :
  *                      @arg PWR_SRAM1_PAGE1_STOP_RETENTION : SRAM1 page 1 retention.
  *                      @arg PWR_SRAM1_PAGE2_STOP_RETENTION : SRAM1 page 2 retention.
  *                      @arg PWR_SRAM1_PAGE3_STOP_RETENTION : SRAM1 page 3 retention.
  *                      @arg PWR_SRAM1_PAGE4_STOP_RETENTION : SRAM1 page 4 retention.
  *                      @arg PWR_SRAM1_PAGE5_STOP_RETENTION : SRAM1 page 5 retention.
#if defined(PWR_CR2_SRAM1PDS6)
  *                      @arg PWR_SRAM1_PAGE6_STOP_RETENTION : SRAM1 page 6 retention.
  *                      @arg PWR_SRAM1_PAGE7_STOP_RETENTION : SRAM1 page 7 retention.
#endif
  *                      @arg PWR_SRAM1_FULL_STOP_RETENTION  : SRAM1 full retention.
  *                      @arg PWR_SRAM2_PAGE1_STOP_RETENTION : SRAM2 page 1 retention.
  *                      @arg PWR_SRAM2_PAGE2_STOP_RETENTION : SRAM2 page 2 retention.
  *                      @arg PWR_SRAM2_PAGE3_STOP_RETENTION : SRAM2 page 3 retention.
  *                      @arg PWR_SRAM2_FULL_STOP_RETENTION  : SRAM2 full retention.
  *                      @arg PWR_ICACHE_STOP_RETENTION      : I-CACHE SRAM retention.
  *                      @arg PWR_FDCAN_USB_STOP_RETENTION   : FDCAN & USB SRAM retention.
  *                      @arg PWR_PKA_STOP_RETENTION         : PKA SRAM retention.
  * @retval None.
  */
void HAL_PWREx_EnableRAMsContentStopRetention(uint32_t RAMSelection)
{
  /* Check the parameters */
  assert_param(IS_PWR_RAM_STOP_RETENTION(RAMSelection));

  /* Enable RAM retention in Stop mode */
  CLEAR_BIT(PWR->CR2, RAMSelection);
}

/**
  * @brief Disable RAMs content retention in Stop mode (Stop 0, 1, 2, 3).
  * @note  When disabling content retention for a given RAM, memory is
  *        powered down in Stop mode. (Consumption is optimized)
  * @param RAMSelection: Specifies RAMs content to be lost in Stop mode.
  *                      This parameter can be one or a combination of the following values :
  *                      @arg PWR_SRAM1_PAGE1_STOP_RETENTION : SRAM1 page 1 retention.
  *                      @arg PWR_SRAM1_PAGE2_STOP_RETENTION : SRAM1 page 2 retention.
  *                      @arg PWR_SRAM1_PAGE3_STOP_RETENTION : SRAM1 page 3 retention.
  *                      @arg PWR_SRAM1_PAGE4_STOP_RETENTION : SRAM1 page 4 retention.
  *                      @arg PWR_SRAM1_PAGE5_STOP_RETENTION : SRAM1 page 5 retention.
#if defined(PWR_CR2_SRAM1PDS6)
  *                      @arg PWR_SRAM1_PAGE6_STOP_RETENTION : SRAM1 page 6 retention.
  *                      @arg PWR_SRAM1_PAGE7_STOP_RETENTION : SRAM1 page 7 retention.
#endif
  *                      @arg PWR_SRAM1_FULL_STOP_RETENTION  : SRAM1 full retention.
  *                      @arg PWR_SRAM2_PAGE1_STOP_RETENTION : SRAM2 page 1 retention.
  *                      @arg PWR_SRAM2_PAGE2_STOP_RETENTION : SRAM2 page 2 retention.
  *                      @arg PWR_SRAM2_PAGE3_STOP_RETENTION : SRAM2 page 3 retention.
  *                      @arg PWR_SRAM2_FULL_STOP_RETENTION  : SRAM2 full retention.
  *                      @arg PWR_ICACHE_STOP_RETENTION      : I-CACHE SRAM retention.
  *                      @arg PWR_FDCAN_USB_STOP_RETENTION   : FDCAN & USB SRAM retention.
  *                      @arg PWR_PKA_STOP_RETENTION         : PKA SRAM retention.
  * @retval None.
  */
void HAL_PWREx_DisableRAMsContentStopRetention(uint32_t RAMSelection)
{
  /* Check the parameters */
  assert_param(IS_PWR_RAM_STOP_RETENTION(RAMSelection));

  /* Disable RAM retention in Stop mode */
  SET_BIT(PWR->CR2, RAMSelection);
}

/**
  * @brief  Enable SRAM2 content retention in Standby mode.
  * @param  SRAM2Pages : Specifies the SRAM2 pages.
  *                      This parameter can be combination of the following values :
  *                      @arg PWR_SRAM2_PAGE1_STANDBY_RETENTION : SRAM2 page 1 retention.
  *                      @arg PWR_SRAM2_PAGE2_STANDBY_RETENTION : SRAM2 page 2 retention.
  *                      @arg PWR_SRAM2_PAGE3_STANDBY_RETENTION : SRAM2 page 3 retention.
  *                      @arg PWR_SRAM2_FULL_STANDBY_RETENTION  : SRAM2 full retention.
  * @retval None.
  */
void HAL_PWREx_EnableSRAM2ContentStandbyRetention(uint32_t SRAM2Pages)
{
  /* Check the parameters */
  assert_param(IS_PWR_SRAM2_STANDBY_RETENTION(SRAM2Pages));

