stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_pwr_ex.c
#if defined(PWR_GPIO_G)
    case PWR_GPIO_G: /* Apply Pull Down to GPIO port G */
      SET_BIT(PWR->PDCRG, GPIO_Pin);
      CLEAR_BIT(PWR->PUCRG, GPIO_Pin);
      break;
#endif /* defined(PWR_GPIO_G) */

    case PWR_GPIO_H: /* Apply Pull Down to GPIO port H */
      SET_BIT(PWR->PDCRH, GPIO_Pin);
      CLEAR_BIT(PWR->PUCRH, GPIO_Pin);
      break;

    default:
      return HAL_ERROR;
      break;
  }

  return HAL_OK;
}

/**
  * @brief  Disable GPIO pull-down state in Stop 3, Standby and Shutdown modes.
  * @note   Reset the relevant PDy bits of PWR_PDCRx register used to configure the I/O
  *         in pull-down state in Stop 3, Standby and Shutdown modes.
  * @note   Even if a PDy bit to reset is reserved, the other PDy bits entered as input
  *         parameter at the same time are reset.
  * @param  GPIO_Port : Specify the IO port.
  *                     This parameter can be a value of
  *                     @ref PWREx_GPIO_Port.
  * @param  GPIO_Pin  : Specify the I/O pins numbers.
  *                     This parameter can be a value of
  *                     @ref PWREx_GPIO_Pin_Mask.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_PWR_GPIO_PORT(GPIO_Port));
  assert_param(IS_PWR_GPIO_PIN_MASK(GPIO_Pin));

  /* Check GPIO port */
  switch (GPIO_Port)
  {
    case PWR_GPIO_A: /* Disable Pull Down for GPIO port A */
      CLEAR_BIT(PWR->PDCRA, (GPIO_Pin & (~(PWR_GPIO_BIT_13 | PWR_GPIO_BIT_15))));
      break;

    case PWR_GPIO_B: /* Disable Pull Down for GPIO port B */
      CLEAR_BIT(PWR->PDCRB, (GPIO_Pin & (~(PWR_GPIO_BIT_4))));
      break;

    case PWR_GPIO_C: /* Disable Pull Down for GPIO port C */
      CLEAR_BIT(PWR->PDCRC, GPIO_Pin);
      break;

    case PWR_GPIO_D: /* Disable Pull Down for GPIO port D */
      CLEAR_BIT(PWR->PDCRD, GPIO_Pin);
      break;

    case PWR_GPIO_E: /* Disable Pull Down for GPIO port E */
      CLEAR_BIT(PWR->PDCRE, GPIO_Pin);
      break;

#if defined(PWR_GPIO_F)
    case PWR_GPIO_F: /* Disable Pull Down for GPIO port F */
      CLEAR_BIT(PWR->PDCRF, GPIO_Pin);
      break;
#endif /* defined(PWR_GPIO_F) */

#if defined(PWR_GPIO_G)
    case PWR_GPIO_G: /* Disable Pull Down for GPIO port G */
      CLEAR_BIT(PWR->PDCRG, GPIO_Pin);
      break;
#endif /* defined(PWR_GPIO_G) */

    case PWR_GPIO_H: /* Disable Pull Down for GPIO port H */
      CLEAR_BIT(PWR->PDCRH, GPIO_Pin);
      break;

    default:
      return HAL_ERROR;
      break;
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group5 I3C Pull-Up Configuration Functions
  * @brief    I3C pull-up configuration functions
  *
@verbatim
 ===============================================================================
                     ##### I3C Pull-Up Configuration functions #####
 ===============================================================================
    [..]
      In Stop modes(2,3), Standby and Shutdown mode, I3C pull-up can be configured to
      maintain an I/O in the pull-up state. The I/Os can be configured through
      PWR_I3CPUCRx registers (x=1,2), or with a pull-down through
      PWR_PDCRx registers (x=A,B,C,D,E,G,H), or can be kept in analog state.

@endverbatim
  * @{
  */

/**
  * @brief  Enable I3C pull-up state in Stop (2, 3), Standby and Shutdown modes.
  * @note   After exiting Stop mode, the I3C pull-up control bits must be cleared
  *         to let I3C peripheral controls I/O pull-up activation.
  * @note   After exiting Standby mode, and after I3C initialization is done,
  *         the I3C pull-up control bits must be cleared, to let I3C peripheral
  *         controls I/O pull-up activation.
  * @note   After exiting Standby mode, and after I3C initialization is done,
  *         the I3C pull-up control bits must be cleared, to let I3C peripheral
  *         controls I/O pull-up activation.
  * @param  Gpio : Specify the I/O pin.
  *                     This parameter can be a value of
  *                     @ref PWREx_I3C_PULLUP_GPIO.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWREx_EnableI3CPullUp(uint32_t Gpio)
{
  /* Check the parameters */
  assert_param(IS_PWR_I3C_PULLUP_GPIO(Gpio));

  if ((Gpio & 0xFFFFU) != 0U)
  {
    SET_BIT(PWR->I3CPUCR1, (Gpio & 0xFFFFU));
  }

  if (((Gpio >> PWR_I3CUPCR2_OFFSET) & 0xFFFFU) != 0U)
  {
    SET_BIT(PWR->I3CPUCR2, ((Gpio >> PWR_I3CUPCR2_OFFSET) & 0xFFFFU));
  }

  return HAL_OK;
}

/**
  * @brief  Disable I3C pull-up state in Stop (2, 3), Standby and Shutdown modes.
  * @param  Gpio : Specify the I/O pin.
  *                     This parameter can be a value of
  *                     @ref PWREx_I3C_PULLUP_GPIO.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWREx_DisableI3CPullUp(uint32_t Gpio)
{
  /* Check the parameters */
  assert_param(IS_PWR_I3C_PULLUP_GPIO(Gpio));

  if ((Gpio & 0xFFFFU) != 0U)
  {
    CLEAR_BIT(PWR->I3CPUCR1, (Gpio & 0xFFFFU));
  }

  if (((Gpio >> PWR_I3CUPCR2_OFFSET) & 0xFFFFU) != 0U)
  {
    CLEAR_BIT(PWR->I3CPUCR2, ((Gpio >> PWR_I3CUPCR2_OFFSET) & 0xFFFFU));
  }

  return HAL_OK;
}
/**
  * @}
  */

#endif /* defined (HAL_PWR_MODULE_ENABLED) */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
